{
  "title": "Universal Manipulation Interface: In-The-Wild Robot Teaching Without In-The-Wild Robots",
  "authors": [
    "Cheng Chi",
    "Zhenjia Xu",
    "Chuer Pan",
    "Eric Cousineau",
    "Benjamin Burchfiel",
    "Siyuan Feng",
    "Russ Tedrake",
    "Shuran Song"
  ],
  "abstract": "We present Universal Manipulation Interface (UMI) -- a data collection and policy learning framework that allows direct skill transfer from in-the-wild human demonstrations to deployable robot policies. UMI employs hand-held grippers coupled with careful interface design to enable portable, low-cost, and information-rich data collection for challenging bimanual and dynamic manipulation demonstrations. To facilitate deployable policy learning, UMI incorporates a carefully designed policy interface with inference-time latency matching and a relative-trajectory action representation. The resulting learned policies are hardware-agnostic and deployable across multiple robot platforms. Equipped with these features, UMI framework unlocks new robot manipulation capabilities, allowing zero-shot generalizable dynamic, bimanual, precise, and long-horizon behaviors, by only changing the training data for each task. We demonstrate UMI's versatility and efficacy with comprehensive real-world experiments, where policies learned via UMI zero-shot generalize to novel environments and objects when trained on diverse human demonstrations. UMI's hardware and software system is open-sourced at https://umi-gripper.github.io.",
  "published": "2024-02-15",
  "arxiv_id": "2402.10329",
  "url": "https://arxiv.org/abs/2402.10329",
  "analysis": {
    "基本信息": {
      "论文标题": "Universal Manipulation Interface: In-The-Wild Robot Teaching Without In-The-Wild Robots",
      "arXiv ID": "2402.10329",
      "关键词": []
    },
    "1_问题背景与动机": {
      "研究问题": "无法解析",
      "现有挑战": [
        "API返回格式异常"
      ],
      "研究动机": "无内容"
    },
    "raw": "",
    "解析状态": "失败 - API返回了非JSON格式"
  },
  "analyzed_at": "2026-01-22T07:12:42.356525"
}