{
  "title": "Universal Manipulation Interface: In-The-Wild Robot Teaching Without In-The-Wild Robots",
  "authors": [
    "Cheng Chi",
    "Zhenjia Xu",
    "Chuer Pan",
    "Eric Cousineau",
    "Benjamin Burchfiel",
    "Siyuan Feng",
    "Russ Tedrake",
    "Shuran Song"
  ],
  "abstract": "We present Universal Manipulation Interface (UMI) -- a data collection and policy learning framework that allows direct skill transfer from in-the-wild human demonstrations to deployable robot policies. UMI employs hand-held grippers coupled with careful interface design to enable portable, low-cost, and information-rich data collection for challenging bimanual and dynamic manipulation demonstrations. To facilitate deployable policy learning, UMI incorporates a carefully designed policy interface with inference-time latency matching and a relative-trajectory action representation. The resulting learned policies are hardware-agnostic and deployable across multiple robot platforms. Equipped with these features, UMI framework unlocks new robot manipulation capabilities, allowing zero-shot generalizable dynamic, bimanual, precise, and long-horizon behaviors, by only changing the training data for each task. We demonstrate UMI's versatility and efficacy with comprehensive real-world experiments, where policies learned via UMI zero-shot generalize to novel environments and objects when trained on diverse human demonstrations. UMI's hardware and software system is open-sourced at https://umi-gripper.github.io.",
  "published": "2024-02-15",
  "arxiv_id": "2402.10329",
  "url": "https://arxiv.org/abs/2402.10329",
  "analysis": {
    "基本信息": {
      "论文标题": "Universal Manipulation Interface: In-The-Wild Robot Teaching Without In-The-Wild Robots",
      "arXiv ID": "2402.10329v3",
      "关键词": [
        "robot manipulation",
        "imitation learning",
        "human demonstration",
        "teleoperation",
        "hardware-agnostic policy"
      ]
    },
    "1_问题背景": {
      "研究问题": "如何让机器人从人类演示中学习复杂的操作技能，同时实现低成本、便携式的数据收集",
      "现有挑战": [
        "传统遥操作需要昂贵的硬件和专家操作员",
        "人类视频到机器人之间存在巨大的实体差异",
        "之前的手持设备在动作多样性和可转移性之间难以平衡"
      ]
    },
    "2_方法核心": {
      "方法概述": "UMI是一个便携式、低成本的机器人数据收集和政策学习框架，使用手持夹爪直接从野外人类演示转移到可部署的机器人政策。UMI采用手持夹爪配合仔细的界面设计，配备宽视场鱼眼镜头和侧镜，通过视觉惯性相机追踪实现稳健的动作提取。",
      "核心创新": [
        "使用鱼眼镜头扩大视野并添加侧镜提供隐式立体观察",
        "采用推理时延迟匹配处理不同传感器观察和执行延迟",
        "使用相对轨迹作为动作表示消除对精确全局动作的需求"
      ]
    },
    "3_具体方法": {
      "模块A": {
        "名称": "UMI演示界面",
        "作用": "收集高质量人类演示数据",
        "输入": "人类手持UMI设备进行演示的动作和视觉信息",
        "输出": "包含视觉、IMU和动作信息的演示数据",
        "实现细节": "采用GoPro相机配备155°鱼眼镜头，在夹爪上安装侧镜提供隐式立体信息，结合内置IMU传感器实现快速运动下的稳健追踪"
      },
      "模块B": {
        "名称": "UMI政策接口",
        "作用": "将人类演示转换为可部署的机器人政策",
        "输入": "UMI收集的演示数据",
        "输出": "硬件无关的机器人控制政策",
        "实现细节": "采用推理时延迟匹配、相对轨迹动作表示和Diffusion Policy建模多模态动作分布"
      },
      "模块C": {
        "名称": "视觉惯性追踪系统",
        "作用": "精确恢复6DoF末端执行器姿态",
        "输入": "鱼眼镜头视频、侧镜图像、IMU数据",
        "输出": "精确的6DoF位姿轨迹",
        "实现细节": "结合视觉特征匹配和IMU约束，解决尺度模糊、运动模糊和纹理不足问题"
      }
    },
    "4_损失函数": [
      {
        "名称": "Diffusion Policy Loss",
        "公式": "基于DDPM的噪声预测损失",
        "作用": "建模人类演示中复杂的多模态动作分布"
      }
    ],
    "5_实验": {
      "数据集": "野外人类演示数据集，包含多种环境和动作",
      "指标": "零样本泛化成功率、任务完成精度、动态操作成功率"
    },
    "7_借鉴句子": [
      "UMI framework unlocks new robot manipulation capabilities, allowing zero-shot generalizable dynamic, bimanual, precise, and long-horizon behaviors, by only changing the training data for each task.",
      "The resulting learned policies are hardware-agnostic and deployable across multiple robot platforms.",
      "UMI eliminates the need for physical robots during data collection and offers a more portable interface for in-the-wild robot teaching."
    ],
    "8_术语": [
      {
        "术语": "UMI",
        "中文": "通用操作接口",
        "解释": "一个数据收集和政策学习框架，允许直接从野外人类演示转移到可部署的机器人政策"
      },
      {
        "术语": "In-The-Wild",
        "中文": "野外",
        "解释": "指在真实、非实验室环境中进行数据收集或操作"
      },
      {
        "术语": "Zero-Shot Generalization",
        "中文": "零样本泛化",
        "解释": "模型在训练时未见过的任务或环境上直接测试的能力"
      },
      {
        "术语": "Bimanual Manipulation",
        "中文": "双臂操作",
        "解释": "使用两个机械臂同时协调完成复杂操作任务"
      },
      {
        "术语": "Fisheye Lens",
        "中文": "鱼眼镜头",
        "解释": "具有超宽视野的镜头，用于增加视觉覆盖范围"
      },
      {
        "术语": "Relative Trajectory",
        "中文": "相对轨迹",
        "解释": "相对于当前状态的轨迹表示，而非绝对坐标"
      },
      {
        "术语": "Diffusion Policy",
        "中文": "扩散政策",
        "解释": "基于扩散模型的动作预测方法，能更好地建模多模态分布"
      }
    ],
    "10_总结": {
      "核心贡献": "提出了UMI框架，首次实现了真正的野外人类演示到多机器人平台的零样本泛化技能转移",
      "方法优势": "UMI具有便携性、低成本、硬件无关性，能够处理动态、双臂、精确和长时程操作任务，仅通过更换训练数据即可实现任务适配"
    }
  },
  "analyzed_at": "2026-01-22T07:54:09.888856"
}