{
  "title": "EasyInsert: A Data-Efficient and Generalizable Insertion Policy",
  "authors": [
    "Guanghe Li",
    "Junming Zhao",
    "Shengjie Wang",
    "Yang Gao"
  ],
  "abstract": "Insertion task is highly challenging that requires robots to operate with exceptional precision in cluttered environments. Existing methods often have poor generalization capabilities. They typically function in restricted and structured environments, and frequently fail when the plug and socket are far apart, when the scene is densely cluttered, or when handling novel objects. They also rely on strong assumptions such as access to CAD models or a digital twin in simulation. To address this, we propose EasyInsert, a framework which leverages the human intuition that relative pose (delta pose) between plug and socket is sufficient for successful insertion, and employs efficient and automated real-world data collection with minimal human labor to train a generalizable model for relative pose prediction. During execution, EasyInsert follows a coarse-to-fine execution procedure based on predicted delta pose, and successfully performs various insertion tasks. EasyInsert demonstrates strong zero-shot generalization capability for unseen objects in cluttered environments, handling cases with significant initial pose deviations while maintaining high sample efficiency and requiring little human effort. In real-world experiments, with just 5 hours of training data, EasyInsert achieves over 90% success in zero-shot insertion for 13 out of 15 unseen novel objects, including challenging objects like Type-C cables, HDMI cables, and Ethernet cables. Furthermore, with only one human demonstration and 4 minutes of automatically collected data for fine-tuning, it reaches over 90% success rate for all 15 objects.",
  "published": "2025-05-22",
  "arxiv_id": "2505.16187",
  "url": "https://arxiv.org/abs/2505.16187",
  "analysis": {
    "基本信息": {
      "论文标题": "EasyInsert: A Data-Efficient and Generalizable Insertion Policy",
      "arXiv ID": "2505.16187",
      "关键词": []
    },
    "raw": "{\n    \"基本信息\": {\n        \"论文标题\": \"EasyInsert: A Data-Efficient and Generalizable Insertion Policy\",\n        \"arXiv ID\": \"2505.16187\",\n        \"作者\": [\n            \"Guanghe Li\",\n            \"Junming Zhao\",\n            \"Shengjie Wang\"\n        ],\n        \"所属机构\": \"清华大学、上海人工智能实验室、上海祺智研究所、吉林大学、复旦大学\",\n        \"关键词\": [\n            \"Robot Manipulation\",\n            \"Generalizable Insertion\",\n            \"Efficient Data Collection\",\n            \"Delta Pose Prediction\",\n            \"Coarse-to-Fine Execution\"\n        ]\n    },\n    \"0_摘要翻译\": {\n        \"背景\": \"插拔任务极具挑战性，要求机器人在杂乱环境中实现极高的操作精度。现有方法通常泛化能力差，仅适用于受限且结构化的环境，在插头与插座距离较远、场景高度拥挤或处理新物体时常常失效。它们还依赖于强假设，如对 CAD 模型的访问或在仿真中的数字孪生。\",\n        \"问题\": \"如何在不依赖 CAD 模型、仿真孪生或大量人工标注的前提下，实现能够在杂乱环境中对未见物体进行零样本插拔的高效策略？\",\n        \"方法\": \"提出 EasyInsert 框架，利用人类直觉——插头与插座之间的相对位姿（Δpose）足以实现成功插入——构建高效且自动化的真实世界数据采集流程，仅需极少人工即可收集 5 小时训练数据。训练一个基于视觉的通用模型直接预测 Δpose，执行阶段采用粗到细的类人执行策略。\",\n        \"结果\": \"在真实实验中，仅使用 5 小时训练数据，EasyInsert 在 13/15 种未见过物体的零样本插拔中实现超过 90% 成功率（包括 Type‑C、HDMI、以太网等难接线缆）。随后在 1 次人类演示 + 4 分钟自动微调后，所有 15 种物体的成功率均超过 90%。\"\n    },\n    \"1_问题背景\": {\n        \"研究问题\": \"实现机器人插拔任务的高泛化与数据效率。\",\n        \"现有挑战\": [\n            \"挑战1：现有方法依赖 CAD 模型或仿真数字孪生，难以在真实环境中泛化。\",\n            \"挑战2：在杂乱场景、初始位姿大幅偏差（6 cm、40°）或处理新物体时成功率显著下降。\",\n            \"挑战3：真实世界数据采集成本高，人工标注与演示需求大，导致模型难以扩展到大规模新物体。\"\n        ],\n        \"研究动机\": \"提高装配线的自动化水平，降低对特定工件的定制成本，并让机器人能够在工厂实际使用的复杂环境中自主执行插拔任务。\",\n        \"gap分析\": \"传统几何或基于仿真的方法在泛化到未见物体和复杂环境方面不足；学习‑based 方法虽能学习策略，但往往需要大量人工演示或在仿真中训练，难以直接迁移到真实场景且对未见物体的零样本泛化表现不佳。\"\n    },\n    \"2_方法核心\": {\n        \"方法概述\": \"EasyInsert 通过视觉模型直接预测插头与插座之间的相对位姿 ΔP，使用粗到细的类人执行策略实现高精度插入。训练数据通过自动化采集（80%）和人工演示（20%）混合构建，仅需 5 小时即可覆盖 5 类物体；随后可对未见物体进行一演示微调，实现全部 15 类物体 >90% 成功率。\",\n        \"整体架构\": \"数据采集模块 → 通用视觉相对位姿预测模型（ΔP） → 执行器（粗对齐→细调→接触检测） →（可选）一演示微调循环。\",\n        \"核心创新\": [\n            \"创新点1：采用相对位姿（Δpose）预测而非直接输出机器人动作，简化学习目标并提升泛化能力。\",\n            \"创新点2：设计了高效自动化的真实世界数据采集方案，80% 数据自动生成、20% 人工演示，仅需 5 小时即可构建跨类别的训练集。\",\n            \"创新点3：实现了类人的粗到细执行策略，能够在初始位姿偏差较大（6 cm、40°）时仍成功对齐并完成插入。\",\n       ",
    "解析状态": "API返回格式异常"
  },
  "analyzed_at": "2026-01-22T21:59:53.678019"
}