{
  "title": "EasyInsert: A Data-Efficient and Generalizable Insertion Policy",
  "authors": [
    "Guanghe Li",
    "Junming Zhao",
    "Shengjie Wang",
    "Yang Gao"
  ],
  "abstract": "Insertion task is highly challenging that requires robots to operate with exceptional precision in cluttered environments. Existing methods often have poor generalization capabilities. They typically function in restricted and structured environments, and frequently fail when the plug and socket are far apart, when the scene is densely cluttered, or when handling novel objects. They also rely on strong assumptions such as access to CAD models or a digital twin in simulation. To address this, we propose EasyInsert, a framework which leverages the human intuition that relative pose (delta pose) between plug and socket is sufficient for successful insertion, and employs efficient and automated real-world data collection with minimal human labor to train a generalizable model for relative pose prediction. During execution, EasyInsert follows a coarse-to-fine execution procedure based on predicted delta pose, and successfully performs various insertion tasks. EasyInsert demonstrates strong zero-shot generalization capability for unseen objects in cluttered environments, handling cases with significant initial pose deviations while maintaining high sample efficiency and requiring little human effort. In real-world experiments, with just 5 hours of training data, EasyInsert achieves over 90% success in zero-shot insertion for 13 out of 15 unseen novel objects, including challenging objects like Type-C cables, HDMI cables, and Ethernet cables. Furthermore, with only one human demonstration and 4 minutes of automatically collected data for fine-tuning, it reaches over 90% success rate for all 15 objects.",
  "published": "2025-05-22",
  "arxiv_id": "2505.16187",
  "url": "https://arxiv.org/abs/2505.16187",
  "analysis": {
    "基本信息": {
      "论文标题": "EasyInsert: A Data-Efficient and Generalizable Insertion Policy",
      "arXiv ID": "2505.16187",
      "关键词": []
    },
    "raw": "{\n    \"基本信息\": {\n        \"论文标题\": \"EasyInsert: A Data-Efficient and Generalizable Insertion Policy\",\n        \"arXiv ID\": \"2505.16187\",\n        \"作者\": [\"Guanghe Li\", \"Junming Zhao\", \"Shengjie Wang\"],\n        \"所属机构\": \"清华大学（Tsinghua University），上海人工智能实验室（Shanghai AI Laboratory），上海期智研究院（Shanghai Qi Zhi Institute），吉林大学（Jilin University），复旦大学（Fudan University）\",\n        \"关键词\": [\"机器人操作（Robot Manipulation）\", \"可泛化插入（Generalizable Insertion）\", \"高效数据收集（Efficient Data Collection）\", \"零样本泛化（Zero-shot Generalization）\", \"少样本微调（One-shot Fine-tuning）\"]\n    },\n    \"0_摘要翻译\": {\n        \"背景\": \"机器人插入任务要求机器人在杂乱环境中以极高精度进行操作，具有高度挑战性。\",\n        \"问题\": \"现有方法通常在受限且结构化的环境中有效，且在插头与插座距离较远、场景高度杂乱或处理未见对象时易失败；同时严重依赖访问CAD模型或仿真数字孪生等强假设，导致泛化能力差。\",\n        \"方法\": \"为此提出EasyInsert框架，利用人类直觉——插头与插座之间的相对位姿（delta pose）足以驱动成功插入；并采用高效且自动化的真实世界数据收集流程，以最小人力成本构建训练数据，从而学习可泛化的相对位姿预测模型。在执行阶段，EasyInsert依据预测的delta pose采用由粗到细的插入流程，完成多种插入任务。\",\n        \"结果\": \"在真实世界实验中，仅用5小时训练数据，EasyInsert在零样本设置下对15个未见对象中的13个实现超过90%的插入成功率（包括Type‑C、HDMI、以太网线等挑战性对象）；在仅有一次人类演示与4分钟自动数据收集的微调后，对全部15个对象均达到超过90%的成功率。\"\n    },\n    \"1_问题背景\": {\n        \"研究问题\": \"如何在真实世界的杂乱环境中，实现机器人对多样未见对象的鲁棒、高精度插入，并保持数据效率与可泛化能力。\",\n        \"现有挑战\": [\n            \"现有方法依赖CAD/数字孪生与仿真，sim‑to‑real差距显著，在未见对象、远距初始位姿或密集杂乱环境中泛化性能差。\",\n            \"真实世界数据采集成本高，难以覆盖足够多样性与空间分布，导致模型对环境与对象变化的适应性不足。\"\n        ],\n        \"研究动机\": \"插入是装配中的基础技能，具备接触丰富与高精度特性，传统程序化方法难以跨对象与场景泛化，亟需数据高效且可泛化的学习式解决方案。\",\n        \"gap分析\": \"现有方法或在仿真中训练后难以迁移到真实，或在真实中训练而受限于小型、干净场景与小样本对象，导致零样本与少样本泛化能力不足。\"\n    },\n    \"2_方法核心\": {\n        \"方法概述\": \"EasyInsert通过相对位姿（delta pose）这一中间表示解耦“视觉感知与定位”与“接触执行”，从视觉直接预测插头与插座的相对位姿，再基于预测执行由粗到细的插入策略。框架采用80%自动+20%人工的数据收集流水线，仅用5小时训练数据实现对15个未见对象中13个的>90%零样本成功率；结合一次人类演示与4分钟自动数据微调后，全部15个对象达>90%成功率。\",\n        \"整体架构\": \"三部分流水线：(1) 混合数据采集模块：80%自动收集（覆盖大范围空间扰动）与20%人工收集（聚焦插座近域精细交互），构建5类对象的数据集；(2) 通用插入策略：从视觉直接预测delta pose，预训练于上述数据集；(3) 由粗到细执行器：基于预测delta pose先粗对齐再细调整并进入接触微调，实现鲁棒插入；面向新目标对象时，可复用数据模块进行一次性演示与4分钟自动数据的微调。\",\n        \"核心创新\": [\n            \"利用相对位姿（delta pose）作为中间表示，弱化绝对定位依赖，增强跨对象与环境泛化。\",\n            \"",
    "解析状态": "API返回格式异常"
  },
  "analyzed_at": "2026-01-22T22:05:26.376880"
}